app/controllers/pessoas_controller.rb

  def index
    @pessoas = Pessoa.all
---
SELECT * FROM "pessoas"

  def show
    @pessoa = Pessoa.find(params[:id])
---
SELECT * FROM "pessoas" WHERE ("pessoas"."id" = 1)

  def create
    @pessoa = Pessoa.new(params[:pessoa])

    respond_to do |format|
      if @pessoa.save
---
INSERT INTO "pessoas" ("telefone", "created_at", "nome", "updated_at") VALUES('88888888', '2010-08-12 02:16:56', 'Pedro', '2010-08-12 02:16:56')

  def destroy
    @pessoa = Pessoa.find(params[:id])
    @pessoa.destroy
---
SELECT * FROM "pessoas" WHERE ("pessoas"."id" = 2)
DELETE FROM "pessoas" WHERE "id" = 2